module.exports = {
    'vAr': { // water -n.
        'sg': ['वाः', 'वाः', 'वाः', 'वारा', 'वारे', 'वारः', 'वारः', 'वारि'],
        'du': ['वारी', 'वारी', 'वारी', 'वार्भ्याम्', 'वार्भ्याम्', 'वार्भ्याम्', 'वारोः', 'वारोः'],
        'pl': ['वारि', 'वारि', 'वारि', 'वार्भिः', 'वार्भ्यः', 'वार्भ्यः', 'वाराम्', 'वार्षु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}
