module.exports = {
    // 'gir': { // praise, song ==== inst,dat,abl
    //     'sg': ['गीः', 'गीः', 'गिरम्', 'गिरा', 'गिरे', 'गिरः', 'गिरः', 'गिरि'],
    //     'du': ['गिरौ', 'गिरौ', 'गिरौ', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गिरोः', 'गिरोः'],
    //     'pl': ['गिरः', 'गिरः', 'गिरः', 'गीर्भिः', 'गीर्भ्यः', 'गीर्भ्यः', 'गिराम्', 'गीर्षु'],
    // },
    'pad': { // foot - m.
        'sg': ['पत्', 'पत्', 'पदम्', 'पदा', 'पदे', 'पदः', 'पदः', 'पदि'],
        'du': ['पदौ', 'पदौ', 'पदौ', 'पद्भ्याम्', 'पद्भ्याम्', 'पद्भ्याम्', 'पदोः', 'पदोः'],
        'pl': ['पदः', 'पदः', 'पदः', 'पद्भिः', 'पद्भ्यः', 'पद्भ्यः', 'पदाम्', 'पत्सु'],
    },

    'sarit': { // river
        'sg': ['सरित्', 'सरित्', 'सरितम्', 'सरिता', 'सरिते', 'सरितः', 'सरितः', 'सरिति'],
        'du': ['सरितौ', 'सरितौ', 'सरितौ', 'सरिद्भ्याम्', 'सरिद्भ्याम्', 'सरिद्भ्याम्', 'सरितोः', 'सरितोः'],
        'pl': ['सरितः', 'सरितः', 'सरितः', 'सरिद्भिः', 'सरिद्भ्यः', 'सरिद्भ्यः', 'सरिताम्', 'सरित्सु'],
    },

    'marut': { // wind - m.
        'sg': ['मरुत्', 'मरुत्', 'मरुतम्', 'मरुता', 'मरुते', 'मरुतः', 'मरुतः', 'मरुति'],
        'du': ['मरुतौ', 'मरुतौ', 'मरुतौ', 'मरुद्भ्याम्', 'मरुद्भ्याम्', 'मरुद्भ्याम्', 'मरुतोः', 'मरुतोः'],
        'pl': ['मरुतः', 'मरुतः', 'मरुतः', 'मरुद्भिः', 'मरुद्भ्यः', 'मरुद्भ्यः', 'मरुताम्', 'मरुत्सु'],
    },

    // 'druh': { // demon - m. excep d -> D
    //     'sg': ['ध्रुट्-ध्रुक्', 'ध्रुट्-ध्रुक्', 'द्रुहम्', 'द्रुहा', 'द्रुहे', 'द्रुहः', 'द्रुहः', 'द्रुहि'],
    //     'du': ['द्रुहौ', 'द्रुहौ', 'द्रुहौ', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'द्रुहोः', 'द्रुहोः'],
    //     'pl': ['द्रुहः', 'द्रुहः', 'द्रुहः', 'ध्रुड्भिः-ध्रुग्भिः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'द्रुहाम्', 'ध्रुट्सु-ध्रुक्षु'],
    // },

    'kzam': { // earth, ground
        'sg': ['क्षम्', 'क्षम्', 'क्षमम्', 'क्षमा', 'क्षमे', 'क्षमः', 'क्षमः', 'क्षमि'],
        'du': ['क्षमौ', 'क्षमौ', 'क्षमौ', 'क्षंभ्याम्', 'क्षंभ्याम्', 'क्षंभ्याम्', 'क्षमोः', 'क्षमोः'],
        'pl': ['क्षमः', 'क्षमः', 'क्षमः', 'क्षंभिः', 'क्षंभ्यः', 'क्षंभ्यः', 'क्षमाम्', 'क्षंसु'],
    },
    'stuB': { // praising, m.
        'sg': ['स्तुप्', 'स्तुप्', 'स्तुभम्', 'स्तुभा', 'स्तुभे', 'स्तुभः', 'स्तुभः', 'स्तुभि'],
        'du': ['स्तुभौ', 'स्तुभौ', 'स्तुभौ', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुभोः', 'स्तुभोः'],
        'pl': ['स्तुभः', 'स्तुभः', 'स्तुभः', 'स्तुब्भिः', 'स्तुब्भ्यः', 'स्तुब्भ्यः', 'स्तुभाम्', 'स्तुप्सु'],
    },

    'viS': { // a man, person
        'sg': ['विट्', 'विट्', 'विशम्', 'विशा', 'विशे', 'विशः', 'विशः', 'विशि'],
        'du': ['विशौ', 'विशौ', 'विशौ', 'विड्भ्याम्', 'विड्भ्याम्', 'विड्भ्याम्', 'विशोः', 'विशोः'],
        'pl': ['विशः', 'विशः', 'विशः', 'विड्भिः', 'विड्भ्यः', 'विड्भ्यः', 'विशाम्', 'विट्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    // palatal
    'samrAj': { // emperor  - सम्राज्
        'sg': ['सम्राट्', 'सम्राट्', 'सम्राजम्', 'सम्राजा', 'सम्राजे', 'सम्राजः', 'सम्राजः', 'सम्राजि'],
        'du': ['सम्राजौ', 'सम्राजौ', 'सम्राजौ', 'सम्राड्भ्याम्', 'सम्राड्भ्याम्', 'सम्राड्भ्याम्', 'सम्राजोः', 'सम्राजोः'],
        'pl': ['सम्राजः', 'सम्राजः', 'सम्राजः', 'सम्राड्भिः', 'सम्राड्भ्यः', 'सम्राड्भ्यः', 'सम्राजाम्', 'सम्राट्सु'],
    },
    'yuj': { // companion
        'sg': ['युङ्', 'युङ्', 'युञ्जम्', 'युजा', 'युजे', 'युजः', 'युजः', 'युजि'],
        'du': ['युञ्जौ', 'युञ्जौ', 'युञ्जौ', 'युग्भ्याम्', 'युग्भ्याम्', 'युग्भ्याम्', 'युजोः', 'युजोः'],
        'pl': ['युञ्जः', 'युञ्जः', 'युजः', 'युग्भिः', 'युग्भ्यः', 'युग्भ्यः', 'युजाम्', 'युक्षु'],
    },
    'rAj': { // king - m.
        'sg': ['राट्', 'राट्', 'राजम्', 'राजा', 'राजे', 'राजः', 'राजः', 'राजि'],
        'du': ['राजौ', 'राजौ', 'राजौ', 'राड्भ्याम्', 'राड्भ्याम्', 'राड्भ्याम्', 'राजोः', 'राजोः'],
        'pl': ['राजः', 'राजः', 'राजः', 'राड्भिः', 'राड्भ्यः', 'राड्भ्यः', 'राजाम्', 'राट्सु'],
    },
    'lih': { // mild wind
        'sg': ['लिट्', 'लिट्', 'लिहम्', 'लिहा', 'लिहे', 'लिहः', 'लिहः', 'लिहि'],
        'du': ['लिहौ', 'लिहौ', 'लिहौ', 'लिड्भ्याम्', 'लिड्भ्याम्', 'लिड्भ्याम्', 'लिहोः', 'लिहोः'],
        'pl': ['लिहः', 'लिहः', 'लिहः', 'लिड्भिः', 'लिड्भ्यः', 'लिड्भ्यः', 'लिहाम्', 'लिट्सु'],
    },

}
