var desc = {gend: 'neut', dict: 'ि', var: 'i'};

var tests = {
    'vAri': { // water
        'sg': ['वारि', 'वारि', 'वारिणा', 'वारिणे', 'वारिणः', 'वारिणः', 'वारिणि', 'वारे'],
        'du': ['वारिणी', 'वारिणी', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिणोः', 'वारिणोः', 'वारिणी'],
        'pl': ['वारीणि', 'वारीणि', 'वारिभिः', 'वारिभ्यः', 'वारिभ्यः', 'वारीणाम्', 'वारिषु', 'वारीणि']
    },

    'दधि': { // curd
        'sg': ['दधि', 'दधि', 'दध्ना', 'दध्ने', 'दध्नः', 'दध्नः', 'दध्नि-दधिनि', 'दधि-दधे'],
        'du': ['दधिनी', 'दधिनी', 'दधिभ्याम्', 'दधिभ्याम्', 'दधिभ्याम्', 'दध्नोः', 'दध्नोः', 'दधिनी'],
        'pl': ['दधीनि', 'दधीनि', 'दधिभिः', 'दधिभिः', 'दधिभिः', 'दध्नाम्', 'दधिषु', 'दधीनि']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
