var desc = {gend: 'masc', dict: 'ु', var: 'u'};

var tests = {
    'guru': { // guru
        'sg': ['गुरुः', 'गुरुम्', 'गुरुणा', 'गुरवे', 'गुरोः', 'गुरोः', 'गुरौ', 'गुरो'],
        'du': ['गुरू', 'गुरू', 'गुरुभ्याम्', 'गुरुभ्याम्', 'गुरुभ्याम्', 'गुर्वोः', 'गुर्वोः', 'गुरू'],
        'pl': ['गुरवः', 'गुरून्', 'गुरुभिः', 'गुरुभ्यः', 'गुरुभ्यः', 'गुरूणाम्', 'गुरुषु', 'गुरवः']
    },
    'taru': { // tree
        'sg': ['तरुः', 'तरुम्', 'तरुणा', 'तरवे', 'तरोः', 'तरोः', 'तरौ', 'तरो'],
        'du': ['तरू', 'तरू', 'तरुभ्याम्', 'तरुभ्याम्', 'तरुभ्याम्', 'तर्वोः', 'तर्वोः', 'तरू'],
        'pl': ['तरवः', 'तरून्', 'तरुभिः', 'तरुभ्यः', 'तरुभ्यः', 'तरूणाम्', 'तरुषु', 'तरवः']
    },
    'paSu': { // animal
        'sg': ['पशुः', 'पशुम्', 'पशुना', 'पशवे', 'पशोः', 'पशोः', 'पशौ', 'पशो'],
        'du': ['पशू', 'पशू', 'पशुभ्याम्', 'पशुभ्याम्', 'पशुभ्याम्', 'पश्वोः', 'पश्वोः', 'पशू'],
        'pl': ['पशवः', 'पशून्', 'पशुभिः', 'पशुभ्यः', 'पशुभ्यः', 'पशूनाम्', 'पशुषु', 'पशवः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
