var desc = {gend: 'fem', dict: 'स्', var: 'as'};

var tests = {
    'nas': { // nose - f.
        'sg': ['नाः', 'नसम्', 'नसा', 'नसे', 'नसः', 'नसः', 'नसि', 'नः'],
        'du': ['नसौ', 'नसौ', 'नोभ्याम्', 'नोभ्याम्', 'नोभ्याम्', 'नसोः', 'नसोः', 'नसौ'],
        'pl': ['नसः', 'नसः', 'नोभिः', 'नोभ्यः', 'नोभ्यः', 'नसाम्', 'नःसु', 'नसः']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
