var desc = {gend: 'fem', dict: 'िर्', var: 'ir'};

var tests = {
    'gir': { // song
        'sg': ['गीः', 'गिरम्', 'गिरा', 'गिरे', 'गिरः', 'गिरः', 'गिरि', 'गीः'],
        'du': ['गिरौ', 'गिरौ', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गिरोः', 'गिरोः', 'गिरौ'],
        'pl': ['गिरः', 'गिरः', 'गीर्भिः', 'गीर्भ्यः', 'गीर्भ्यः', 'गिराम्', 'गीर्षु', 'गिरः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },

}


module.exports = {
    desc: desc,
    tests: tests
}
