module.exports = {
    'maDu': { // neut - honey
        'sg': ['मधु', 'मधो', 'मधु', 'मधुना', 'मधुने', 'मधुनः', 'मधुनः', 'मधुनि'],
        'du': ['मधुनी', 'मधुनी', 'मधुनी', 'मधुभ्याम्', 'मधुभ्याम्', 'मधुभ्याम्', 'मधुनोः', 'मधुनोः'],
        'pl': ['मधूनि', 'मधूनि', 'मधूनि', 'मधुभिः', 'मधुभ्यः', 'मधुभ्यः', 'मधूनाम्', 'मधुषु'],
    },
    'mfdu': { // softness
        'sg': ['मृदु', 'मृदो', 'मृदु', 'मृदुना', 'मृदुने', 'मृदुनः', 'मृदुनः', 'मृदुनि'],
        'du': ['मृदुनी', 'मृदुनी', 'मृदुनी', 'मृदुभ्याम्', 'मृदुभ्याम्', 'मृदुभ्याम्', 'मृदुनोः', 'मृदुनोः'],
        'pl': ['मृदूनि', 'मृदूनि', 'मृदूनि', 'मृदुभिः', 'मृदुभ्यः', 'मृदुभ्यः', 'मृदूनाम्', 'मृदुषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}
