var desc = {gend: 'neut', dict: 'स्', var: 'as'};

var tests = {
    'manas': { // mind
        'sg': ['मनः', 'मनः', 'मनसा', 'मनसे', 'मनसः', 'मनसः', 'मनसि', 'मनः'],
        'du': ['मनसी', 'मनसी', 'मनोभ्याम्', 'मनोभ्याम्', 'मनोभ्याम्', 'मनसोः', 'मनसोः', 'मनसी'],
        'pl': ['मनांसि', 'मनांसि', 'मनोभिः', 'मनोभ्यः', 'मनोभ्यः', 'मनसाम्', 'मनःसु', 'मनांसि']
    },
    'uzas': { // dawn
        'sg': ['उषः', 'उषः', 'उषसा', 'उषसे', 'उषसः', 'उषसः', 'उषसि', 'उषः'],
        'du': ['उषसी', 'उषसी', 'उषोभ्याम्', 'उषोभ्याम्', 'उषोभ्याम्', 'उषसोः', 'उषसोः', 'उषसी'],
        'pl': ['उषांसि', 'उषांसि', 'उषोभिः', 'उषोभ्यः', 'उषोभ्यः', 'उषसाम्', 'उषःसु', 'उषांसि']
    },

    'svavas': { // adj. having or affording good protection
        'sg': ['स्ववः', 'स्ववः', 'स्ववसा', 'स्ववसे', 'स्ववसः', 'स्ववसः', 'स्ववसि', 'स्ववः'],
        'du': ['स्ववसी', 'स्ववसी', 'स्ववोभ्याम्', 'स्ववोभ्याम्', 'स्ववोभ्याम्', 'स्ववसोः', 'स्ववसोः', 'स्ववसी'],
        'pl': ['स्ववांसि', 'स्ववांसि', 'स्ववोभिः', 'स्ववोभ्यः', 'स्ववोभ्यः', 'स्ववसाम्', 'स्ववःसु', 'स्ववांसि']
    },

    'apas': { // work
        'sg': ['अपः', 'अपः', 'अपसा', 'अपसे', 'अपसः', 'अपसः', 'अपसि', 'अपः'],
        'du': ['अपसी', 'अपसी', 'अपोभ्याम्', 'अपोभ्याम्', 'अपोभ्याम्', 'अपसोः', 'अपसोः', 'अपसी'],
        'pl': ['अपांसि', 'अपांसि', 'अपोभिः', 'अपोभ्यः', 'अपोभ्यः', 'अपसाम्', 'अपःसु', 'अपांसि']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
