var desc = {gend: 'masc', dict: 'ै', var: 'E'};

// здесь dict д.б. - минус A  плюс E

var tests = {
    'rE': { // relm, property, goods
        'sg': ['राः', 'रायम्', 'राया', 'राये', 'रायः', 'रायः', 'रायि', 'राः'],
        'du': ['रायौ', 'रायौ', 'राभ्याम्', 'राभ्याम्', 'राभ्याम्', 'रायोः', 'रायोः', 'रायौ'],
        'pl': ['रायः', 'रायः', 'राभिः', 'राभ्यः', 'राभ्यः', 'रायाम्', 'रासु', 'रायः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    // tests: tests
}
