var desc = {gend: 'neut', dict: 'ि', var: 'i'};

var tests = {
    'vAri': { // water
        'sg': ['वारि', 'वारि', 'वारिणा', 'वारिणे', 'वारिणः', 'वारिणः', 'वारिणि', 'वारे'],
        'du': ['वारिणी', 'वारिणी', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिणोः', 'वारिणोः', 'वारिणी'],
        'pl': ['वारीणि', 'वारीणि', 'वारिभिः', 'वारिभ्यः', 'वारिभ्यः', 'वारीणाम्', 'वारिषु', 'वारीणि']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
