module.exports = {
    'rE': { // relm, property, goods
        'sg': ['राः', 'राः', 'रायम्', 'राया', 'राये', 'रायः', 'रायः', 'रायि'],
        'du': ['रायौ', 'रायौ', 'रायौ', 'राभ्याम्', 'राभ्याम्', 'राभ्याम्', 'रायोः', 'रायोः'],
        'pl': ['रायः', 'रायः', 'रायः', 'राभिः', 'राभ्यः', 'राभ्यः', 'रायाम्', 'रासु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}
