var desc = {gend: 'masc', dict: 'िन्', var: 'in'};

var tests = {
    'ज्ञानिन्': { // wise
        'sg': ['ज्ञानी', 'ज्ञानिनम्', 'ज्ञानिना', 'ज्ञानिने', 'ज्ञानिनः', 'ज्ञानिनः', 'ज्ञानिनि', 'ज्ञानिन्'],
        'du': ['ज्ञानिनौ', 'ज्ञानिनौ', 'ज्ञानिभ्याम्', 'ज्ञानिभ्याम्', 'ज्ञानिभ्याम्', 'ज्ञानिनोः', 'ज्ञानिनोः', 'ज्ञानिनौ'],
        'pl': ['ज्ञानिनः', 'ज्ञानिनः', 'ज्ञानिभिः', 'ज्ञानिभ्यः', 'ज्ञानिभ्यः', 'ज्ञानिनाम्', 'ज्ञानिषु', 'ज्ञानिनः']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },

}

module.exports = {
    desc: desc,
    tests: tests
}
