var desc = {gend: 'neut', dict: 'िस्', var: 'is'};

var tests = {
    'havis': { // oblation
        'sg': ['हविः', 'हविः', 'हविषा', 'हविषे', 'हविषः', 'हविषः', 'हविषि', 'हविः'],
        'du': ['हविषी', 'हविषी', 'हविर्भ्याम्', 'हविर्भ्याम्', 'हविर्भ्याम्', 'हविषोः', 'हविषोः', 'हविषी'],
        'pl': ['हवींषि', 'हवींषि', 'हविर्भिः', 'हविर्भ्यः', 'हविर्भ्यः', 'हविषाम्', 'हविःषु', 'हवींषि']
    },
    'ज्योतिस्': { // light
        'sg': ['ज्योतिः', 'ज्योतिः', 'ज्योतिषा', 'ज्योतिषे', 'ज्योतिषः', 'ज्योतिषः', 'ज्योतिषि', 'ज्योतिः'],
        'du': ['ज्योतिषी', 'ज्योतिषी', 'ज्योतिर्भ्याम्', 'ज्योतिर्भ्याम्', 'ज्योतिर्भ्याम्', 'ज्योतिषोः', 'ज्योतिषोः', 'ज्योतिषी'],
        'pl': ['ज्योतिंषि', 'ज्योतिंषि', 'ज्योतिर्भिः', 'ज्योतिर्भ्यः', 'ज्योतिर्भ्यः', 'ज्योतिषाम्', 'ज्योतिष्षु', 'ज्योतिंषि']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
