module.exports = {
    'Denu': { // cow
        'sg': ['धेनुः', 'धेनो', 'धेनुम्', 'धेन्वा', 'धेनवे-धेन्वै', 'धेनोः-धेन्वाः', 'धेनोः-धेन्वाः', 'धेनौ-धेन्वाम्'],
        'du': ['धेनू', 'धेनू', 'धेनू', 'धेनुभ्याम्', 'धेनुभ्याम्', 'धेनुभ्याम्', 'धेन्वोः', 'धेन्वोः'],
        'pl': ['धेनवः', 'धेनवः', 'धेनूः', 'धेनुभिः', 'धेनुभ्यः', 'धेनुभ्यः', 'धेनूनाम्', 'धेनुषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}
