var desc = {gend: 'neut', dict: 'न्', var: 'an'};
var test = {
    'nAman': { // name
        'sg': ['नाम', 'नाम', 'नाम्ना', 'नाम्ने', 'नाम्नः', 'नाम्नः', 'नामनि-नाम्नि', 'नामन्-नाम'],
        'du': ['नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामभ्याम्', 'नामभ्याम्', 'नामभ्याम्', 'नाम्नोः', 'नाम्नोः', 'नामनी-नाम्नी'],
        'pl': ['नामानि', 'नामानि', 'नामभिः', 'नामभ्यः', 'नामभ्यः', 'नाम्नाम्', 'नामसु', 'नामानि']
    },

    'जन्मन्': { // birth
        'sg': ['जन्म','जन्म','जन्मना','जन्मने','जन्मनः','जन्मनः','जन्मनि', 'जन्म-जन्मन्'],
        'du': ['जन्मनी','जन्मनी','जन्मभ्याम्','जन्मभ्याम्','जन्मभ्याम्','जन्मनोः','जन्मनोः', 'जन्मनी'],
        'pl': ['जन्मानि','जन्मानि','जन्मभिः','जन्मभ्यः','जन्मभ्यः','जन्मनाम्','जन्मसु', 'जन्मानि']
    },

   '': { //
       'sg': ['', '', '', '', '', '', '', ''],
       'du': ['', '', '', '', '', '', '', ''],
       'pl': ['', '', '', '', '', '', '', '']
    },


}

module.exports = {
    desc: desc,
    test: test
}
