var desc = {gend: 'fem', dict: 'ु', var: 'u'};
var tests = {
    'Denu': { // cow
        'sg': ['धेनुः', 'धेनुम्', 'धेन्वा', 'धेनवे-धेन्वै', 'धेनोः-धेन्वाः', 'धेनोः-धेन्वाः', 'धेनौ-धेन्वाम्', 'धेनो'],
        'du': ['धेनू', 'धेनू', 'धेनुभ्याम्', 'धेनुभ्याम्', 'धेनुभ्याम्', 'धेन्वोः', 'धेन्वोः', 'धेनू'],
        'pl': ['धेनवः', 'धेनूः', 'धेनुभिः', 'धेनुभ्यः', 'धेनुभ्यः', 'धेनूनाम्', 'धेनुषु', 'धेनवः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
