var desc = {gend: 'neut', dict: 'िस्', var: 'is'};

var tests = {
    'havis': { // oblation
        'sg': ['हविः', 'हविः', 'हविषा', 'हविषे', 'हविषः', 'हविषः', 'हविषि', 'हविः'],
        'du': ['हविषी', 'हविषी', 'हविर्भ्याम्', 'हविर्भ्याम्', 'हविर्भ्याम्', 'हविषोः', 'हविषोः', 'हविषी'],
        'pl': ['हवींषि', 'हवींषि', 'हविर्भिः', 'हविर्भ्यः', 'हविर्भ्यः', 'हविषाम्', 'हविःषु', 'हवींषि']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
