module.exports = {
    'nAman': { // name
        'sg': ['नाम', 'नामन्-नाम', 'नाम', 'नाम्ना', 'नाम्ने', 'नाम्नः', 'नाम्नः', 'नामनि-नाम्नि'],
        'du': ['नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामभ्याम्', 'नामभ्याम्', 'नामभ्याम्', 'नाम्नोः', 'नाम्नोः'],
        'pl': ['नामानि', 'नामानि', 'नामानि', 'नामभिः', 'नामभ्यः', 'नामभ्यः', 'नाम्नाम्', 'नामसु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },


}
