var desc = {gend: 'masc', dict: 'ृ', var: 'f'};

var tests = {
    'pitf': { // father
        'sg': ['पिता', 'पितरम्', 'पित्रा', 'पित्रे', 'पितुः', 'पितुः', 'पितरि', 'पितः'],
        'du': ['पितरौ', 'पितरौ', 'पितृभ्याम्', 'पितृभ्याम्', 'पितृभ्याम्', 'पित्रोः', 'पित्रोः', 'पितरौ'],
        'pl': ['पितरः', 'पितॄन्', 'पितृभिः', 'पितृभ्यः', 'पितृभ्यः', 'पितॄणाम्', 'पितृषु', 'पितरः']
    },
    'kartf': { // subject of a sentence
        'sg': ['कर्ता', 'कर्तारम्', 'कर्त्रा', 'कर्त्रे', 'कर्तुः', 'कर्तुः', 'कर्तरि', 'कर्तः'],
        'du': ['कर्तारौ', 'कर्तारौ', 'कर्तृभ्याम्', 'कर्तृभ्याम्', 'कर्तृभ्याम्', 'कर्त्रोः', 'कर्त्रोः', 'कर्तारौ'],
        'pl': ['कर्तारः', 'कर्तॄन्', 'कर्तृभिः', 'कर्तृभ्यः', 'कर्तृभ्यः', 'कर्तॄणाम्', 'कर्तृषु', 'कर्तारः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
