var desc = {gend: 'masc', dict: 'स्', var: 'us'};
// FIXME: тут, похоже, тоже нужно следать через del: вычитать u и добавлять us

var tests = {
    'janus': { // birth, creation
        'sg': ['जनुः', 'जनुषम्', 'जनुषा', 'जनुषे', 'जनुषः', 'जनुषः', 'जनुषि', 'जनुः'],
        'du': ['जनुषौ', 'जनुषौ', 'जनुर्भ्याम्', 'जनुर्भ्याम्', 'जनुर्भ्याम्', 'जनुषोः', 'जनुषोः', 'जनुषौ'],
        'pl': ['जनुषः', 'जनुषः', 'जनुर्भिः', 'जनुर्भ्यः', 'जनुर्भ्यः', 'जनुषाम्', 'जनुःषु', 'जनुषः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },
}

module.exports = {
    desc: desc,
    tests: tests
}
