module.exports = {
    'vAri': { // water
        'sg': ['वारि', 'वारे', 'वारि', 'वारिणा', 'वारिणे', 'वारिणः', 'वारिणः', 'वारिणि'],
        'du': ['वारिणी', 'वारिणी', 'वारिणी', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिभ्याम्', 'वारिणोः', 'वारिणोः'],
        'pl': ['वारीणि', 'वारीणि', 'वारीणि', 'वारिभिः', 'वारिभ्यः', 'वारिभ्यः', 'वारीणाम्', 'वारिषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}
