module.exports = {
    'jagat': { // world, cow
        'sg': ['जगत्', 'जगत्', 'जगत्', 'जगता', 'जगते', 'जगतः', 'जगतः', 'जगति'],
        'du': ['जगती', 'जगती', 'जगती', 'जगद्भ्याम्', 'जगद्भ्याम्', 'जगद्भ्याम्', 'जगतोः', 'जगतोः'],
        'pl': ['जगन्ति', 'जगन्ति', 'जगन्ति', 'जगद्भिः', 'जगद्भ्यः', 'जगद्भ्यः', 'जगताम्', 'जगत्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}
