var desc = {gend: 'neut', dict: 'त्', var: 'at'};

var tests = {

    'dyumat': { // neut. - eye
        'sg': ['द्युमत्', 'द्युमत्', 'द्युमता', 'द्युमते', 'द्युमतः', 'द्युमतः', 'द्युमति', 'द्युमत्'],
        'du': ['द्युमती', 'द्युमती', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमतोः', 'द्युमतोः', 'द्युमती'],
        'pl': ['द्युमन्ति', 'द्युमन्ति', 'द्युमद्भिः', 'द्युमद्भ्यः', 'द्युमद्भ्यः', 'द्युमताम्', 'द्युमत्सु', 'द्युमन्ति']
    },

    'जगत्': { // world
        'sg': ['जगत्-जगद्', 'जगत्-जगद्', 'जगता', 'जगते', 'जगतः', 'जगतः', 'जगति', 'जगत्-जगद्'],
        'du': ['जगती', 'जगती', 'जगद्भ्याम्', 'जगद्भ्याम्', 'जगद्भ्याम्', 'जगतोः', 'जगतोः', 'जगती'],
        'pl': ['जगन्ति', 'जगन्ति', 'जगद्भिः', 'जगद्भ्यः', 'जगद्भ्यः', 'जगताम्', 'जगत्सु', 'जगन्ति']
    },

}

module.exports = {
    desc: desc,
    tests: tests
}
