var desc = {gend: 'neut', dict: 'त्', var: 'at'};

var tests = {

    'dyumat': { // neut. - eye
        'sg': ['द्युमत्', 'द्युमत्', 'द्युमता', 'द्युमते', 'द्युमतः', 'द्युमतः', 'द्युमति', 'द्युमत्'],
        'du': ['द्युमती', 'द्युमती', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमतोः', 'द्युमतोः', 'द्युमती'],
        'pl': ['द्युमन्ति', 'द्युमन्ति', 'द्युमद्भिः', 'द्युमद्भ्यः', 'द्युमद्भ्यः', 'द्युमताम्', 'द्युमत्सु', 'द्युमन्ति']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },

}

module.exports = {
    desc: desc,
    tests: tests
}
