var desc = {gend: 'masc', dict: '', var: '', cons: true};
var tests = {
    'pad': { // foot - m.
        'sg': ['पत्', 'पदम्', 'पदा', 'पदे', 'पदः', 'पदः', 'पदि', 'पत्'],
        'du': ['पदौ', 'पदौ', 'पद्भ्याम्', 'पद्भ्याम्', 'पद्भ्याम्', 'पदोः', 'पदोः', 'पदौ'],
        'pl': ['पदः', 'पदः', 'पद्भिः', 'पद्भ्यः', 'पद्भ्यः', 'पदाम्', 'पत्सु', 'पदः']
    },

    'sarit': { // river
        'sg': ['सरित्', 'सरितम्', 'सरिता', 'सरिते', 'सरितः', 'सरितः', 'सरिति', 'सरित्'],
        'du': ['सरितौ', 'सरितौ', 'सरिद्भ्याम्', 'सरिद्भ्याम्', 'सरिद्भ्याम्', 'सरितोः', 'सरितोः', 'सरितौ'],
        'pl': ['सरितः', 'सरितः', 'सरिद्भिः', 'सरिद्भ्यः', 'सरिद्भ्यः', 'सरिताम्', 'सरित्सु', 'सरितः']
    },

    'marut': { // wind - m.
        'sg': ['मरुत्', 'मरुतम्', 'मरुता', 'मरुते', 'मरुतः', 'मरुतः', 'मरुति', 'मरुत्'],
        'du': ['मरुतौ', 'मरुतौ', 'मरुद्भ्याम्', 'मरुद्भ्याम्', 'मरुद्भ्याम्', 'मरुतोः', 'मरुतोः', 'मरुतौ'],
        'pl': ['मरुतः', 'मरुतः', 'मरुद्भिः', 'मरुद्भ्यः', 'मरुद्भ्यः', 'मरुताम्', 'मरुत्सु', 'मरुतः']
    },

    // 'druh': { // demon - m. excep d -> D
    //     'sg': ['ध्रुट्-ध्रुक्', 'द्रुहम्', 'द्रुहा', 'द्रुहे', 'द्रुहः', 'द्रुहः', 'द्रुहि', 'ध्रुट्-ध्रुक्'],
    //     'du': ['द्रुहौ', 'द्रुहौ', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'द्रुहोः', 'द्रुहोः', 'द्रुहौ'],
    //     'pl': ['द्रुहः', 'द्रुहः', 'ध्रुड्भिः-ध्रुग्भिः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'द्रुहाम्', 'ध्रुट्सु-ध्रुक्षु', 'द्रुहः']
    // },

    'kzam': { // earth, ground
        'sg': ['क्षम्', 'क्षमम्', 'क्षमा', 'क्षमे', 'क्षमः', 'क्षमः', 'क्षमि', 'क्षम्'],
        'du': ['क्षमौ', 'क्षमौ', 'क्षंभ्याम्', 'क्षंभ्याम्', 'क्षंभ्याम्', 'क्षमोः', 'क्षमोः', 'क्षमौ'],
        'pl': ['क्षमः', 'क्षमः', 'क्षंभिः', 'क्षंभ्यः', 'क्षंभ्यः', 'क्षमाम्', 'क्षंसु', 'क्षमः']
    },
    'stuB': { // praising, m.
        'sg': ['स्तुप्', 'स्तुभम्', 'स्तुभा', 'स्तुभे', 'स्तुभः', 'स्तुभः', 'स्तुभि', 'स्तुप्'],
        'du': ['स्तुभौ', 'स्तुभौ', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुभोः', 'स्तुभोः', 'स्तुभौ'],
        'pl': ['स्तुभः', 'स्तुभः', 'स्तुब्भिः', 'स्तुब्भ्यः', 'स्तुब्भ्यः', 'स्तुभाम्', 'स्तुप्सु', 'स्तुभः']
    },

    'viS': { // a man, person
        'sg': ['विट्', 'विशम्', 'विशा', 'विशे', 'विशः', 'विशः', 'विशि', 'विट्'],
        'du': ['विशौ', 'विशौ', 'विड्भ्याम्', 'विड्भ्याम्', 'विड्भ्याम्', 'विशोः', 'विशोः', 'विशौ'],
        'pl': ['विशः', 'विशः', 'विड्भिः', 'विड्भ्यः', 'विड्भ्यः', 'विशाम्', 'विट्सु', 'विशः']
    },
    // palatal
    'samrAj': { // emperor  - सम्राज्
        'sg': ['सम्राट्', 'सम्राजम्', 'सम्राजा', 'सम्राजे', 'सम्राजः', 'सम्राजः', 'सम्राजि', 'सम्राट्'],
        'du': ['सम्राजौ', 'सम्राजौ', 'सम्राड्भ्याम्', 'सम्राड्भ्याम्', 'सम्राड्भ्याम्', 'सम्राजोः', 'सम्राजोः', 'सम्राजौ'],
        'pl': ['सम्राजः', 'सम्राजः', 'सम्राड्भिः', 'सम्राड्भ्यः', 'सम्राड्भ्यः', 'सम्राजाम्', 'सम्राट्सु', 'सम्राजः']
    },
    'yuj': { // companion
        'sg': ['युङ्', 'युञ्जम्', 'युजा', 'युजे', 'युजः', 'युजः', 'युजि', 'युङ्'],
        'du': ['युञ्जौ', 'युञ्जौ', 'युग्भ्याम्', 'युग्भ्याम्', 'युग्भ्याम्', 'युजोः', 'युजोः', 'युञ्जौ'],
        'pl': ['युञ्जः', 'युजः', 'युग्भिः', 'युग्भ्यः', 'युग्भ्यः', 'युजाम्', 'युक्षु', 'युञ्जः']
    },
    'rAj': { // king - m.
        'sg': ['राट्', 'राजम्', 'राजा', 'राजे', 'राजः', 'राजः', 'राजि', 'राट्'],
        'du': ['राजौ', 'राजौ', 'राड्भ्याम्', 'राड्भ्याम्', 'राड्भ्याम्', 'राजोः', 'राजोः', 'राजौ'],
        'pl': ['राजः', 'राजः', 'राड्भिः', 'राड्भ्यः', 'राड्भ्यः', 'राजाम्', 'राट्सु', 'राजः']
    },
    'lih': { // mild wind
        'sg': ['लिट्', 'लिहम्', 'लिहा', 'लिहे', 'लिहः', 'लिहः', 'लिहि', 'लिट्'],
        'du': ['लिहौ', 'लिहौ', 'लिड्भ्याम्', 'लिड्भ्याम्', 'लिड्भ्याम्', 'लिहोः', 'लिहोः', 'लिहौ'],
        'pl': ['लिहः', 'लिहः', 'लिड्भिः', 'लिड्भ्यः', 'लिड्भ्यः', 'लिहाम्', 'लिट्सु', 'लिहः']
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },

}

module.exports = {
    desc: desc,
    tests: tests
}
