module.exports = {
    'nAman': { // name
        'sg': ['नाम', 'नामन्-नाम', 'नाम', 'नाम्ना', 'नाम्ने', 'नाम्नः', 'नाम्नः', 'नामनि-नाम्नि'],
        'du': ['नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामनी-नाम्नी', 'नामभ्याम्', 'नामभ्याम्', 'नामभ्याम्', 'नाम्नोः', 'नाम्नोः'],
        'pl': ['नामानि', 'नामानि', 'नामानि', 'नामभिः', 'नामभ्यः', 'नामभ्यः', 'नाम्नाम्', 'नामसु']
    },

    'जन्मन्': { // birth
        'sg': ['जन्म', 'हे जन्म-जन्मन्','जन्म','जन्मना','जन्मने','जन्मनः','जन्मनः','जन्मनि'],
        'du': ['जन्मनी','हे जन्मनी','जन्मनी','जन्मभ्याम्','जन्मभ्याम्','जन्मभ्याम्','जन्मनोः','जन्मनोः'],
        'pl': ['जन्मानि','हे जन्मानि','जन्मानि','जन्मभिः','जन्मभ्यः','जन्मभ्यः','जन्मनाम्','जन्मसु']
    },

   '': { //
       'sg': ['', '', '', '', '', '', '', ''],
       'du': ['', '', '', '', '', '', '', ''],
       'pl': ['', '', '', '', '', '', '', '']
    },


}
