var desc = {gend: 'masc', dict: 'स्', var: 's'};

var tests = {
    'mAs': { // month - m.
        'sg': ['माः', 'मासम्', 'मासा', 'मासे', 'मासः', 'मासः', 'मासि', 'माः'],
        'du': ['मासौ', 'मासौ', 'मार्भ्याम्', 'मार्भ्याम्', 'मार्भ्याम्', 'मासोः', 'मासोः', 'मासौ'],
        'pl': ['मासः', 'मासः', 'मार्भिः', 'मार्भ्यः', 'मार्भ्यः', 'मासाम्', 'माःसु', 'मासः']
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', '']
    },

}

module.exports = {
    desc: desc,
    tests: tests
}
